app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    @sort = params[:sort]
    @ratingHash = params[:ratings]

    if @sort == nil && @ratingHash == nil && !session.empty?
      flash.keep
      redirect_to movies_path(:sort => session[:sort],
          :ratings => session[:ratings])
    else
      session.clear
      session[:sort] = @sort
      session[:ratings] = @ratingHash
    end


    if @ratingHash != nil
       @ratings = @ratingHash.keys
   else
      @ratings = @all_ratings
   end

    @movies = Movie.where(:rating => @ratings)

    ids = []
    @movies.each do |movie|
       ids.push(movie.id)
    end

    @movies = Movie.find(ids, :order => @sort)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title LIMIT 1
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) ORDER BY release_date